performance-test-reports/main/18041397241/1/user-registration/user_registration/run.log
-    █ [Create Account Service]

-      █ should be able to register new user successfully

-        ✓ is status 200
-        ✓ response body
-        ✓ expected status to equal 200
-        ✓ expected user registration api response to equal 'User Registered'

-    checks.........................: 100.00% ✓ 2400    ✗ 0    
-    data_received..................: 115 kB  1.9 kB/s
-    data_sent......................: 160 kB  2.7 kB/s
-    group_duration.................: avg=3.59ms   min=2.58ms   med=3.44ms   max=19.97ms  p(90)=3.95ms   p(95)=4.28ms  
-    http_req_blocked...............: avg=203.53µs min=118.16µs med=198.88µs max=435.15µs p(90)=258.52µs p(95)=273.6µs 
-    http_req_connecting............: avg=141.44µs min=86.12µs  med=137.4µs  max=249.63µs p(90)=186.07µs p(95)=197.46µs
-  ✓ http_req_duration..............: avg=2.43ms   min=1.76ms   med=2.29ms   max=18.89ms  p(90)=2.65ms   p(95)=2.95ms  
-      { expected_response:true }...: avg=2.43ms   min=1.76ms   med=2.29ms   max=18.89ms  p(90)=2.65ms   p(95)=2.95ms  
-  ✓ http_req_failed................: 0.00%   ✓ 0       ✗ 600  
-    http_req_receiving.............: avg=69.15µs  min=42.59µs  med=66.06µs  max=289.13µs p(90)=86.33µs  p(95)=92.82µs 
-    http_req_sending...............: avg=48.44µs  min=19.91µs  med=45.65µs  max=331.26µs p(90)=65.61µs  p(95)=69.7µs  
-    http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
-    http_req_waiting...............: avg=2.31ms   min=1.65ms   med=2.17ms   max=18.72ms  p(90)=2.51ms   p(95)=2.84ms  
-    http_reqs......................: 600     9.99893/s
-    iteration_duration.............: avg=3.66ms   min=2.63ms   med=3.5ms    max=20.01ms  p(90)=4.02ms   p(95)=4.35ms  
-    iterations.....................: 600     9.99893/s
-    vus............................: 0       min=0     max=0  
-    vus_max........................: 200     min=200   max=200